# Project : Multiple Linear Regression

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv(r'c:\Users\AVINASH RABHADIA\Desktop\Datasets\Startups.csv')

In [3]:
data.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [4]:
data.shape

(50, 5)

In [5]:
states = pd.get_dummies(data.State ,drop_first = True)

In [6]:
states.head()

   Florida  New York
0        0         1
1        0         0
2        1         0
3        0         1
4        1         0

In [7]:
data = data.drop('State',axis =1)

In [8]:
data.head()

   R&D Spend  Administration  Marketing Spend     Profit
0  165349.20       136897.80        471784.10  192261.83
1  162597.70       151377.59        443898.53  191792.06
2  153441.51       101145.55        407934.54  191050.39
3  144372.41       118671.85        383199.62  182901.99
4  142107.34        91391.77        366168.42  166187.94

In [9]:
data = pd.concat([data,states] , axis = 1)

In [10]:
data.tail()

    R&D Spend  Administration  Marketing Spend    Profit  Florida  New York
45    1000.23       124153.04          1903.93  64926.08        0         1
46    1315.46       115816.21        297114.46  49490.75        1         0
47       0.00       135426.92             0.00  42559.73        0         0
48     542.05        51743.15             0.00  35673.41        0         1
49       0.00       116983.80         45173.06  14681.40        0         0

In [11]:
XX = data.loc[:,['Florida','New York']]
XX.head()

   Florida  New York
0        0         1
1        0         0
2        1         0
3        0         1
4        1         0

In [12]:
data.columns

Index(['R&D Spend', 'Administration', 'Marketing Spend', 'Profit', 'Florida',
       'New York'],
      dtype='object')

In [13]:
X = data.iloc[:,[0,1,2,4,5]]

In [14]:
Y = data.iloc[:,3]

In [15]:
X.head()

   R&D Spend  Administration  Marketing Spend  Florida  New York
0  165349.20       136897.80        471784.10        0         1
1  162597.70       151377.59        443898.53        0         0
2  153441.51       101145.55        407934.54        1         0
3  144372.41       118671.85        383199.62        0         1
4  142107.34        91391.77        366168.42        1         0

In [16]:
Y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

In [17]:
from sklearn.model_selection import train_test_split

In [18]:
x_train,x_test,y_train,y_test = train_test_split(X,Y , test_size = 0.20, random_state = 0)

In [19]:
x_train.head()

    R&D Spend  Administration  Marketing Spend  Florida  New York
33   55493.95       103057.49        214634.81        1         0
35   46014.02        85047.44        205517.64        0         1
26   75328.87       144135.98        134050.07        1         0
34   46426.07       157693.92        210797.67        0         0
18   91749.16       114175.79        294919.57        1         0

In [20]:
from sklearn.linear_model import LinearRegression

In [21]:
model = LinearRegression()

In [22]:
model.fit(x_train,y_train)

LinearRegression()

In [23]:
y_pred = model.predict(x_test)

In [24]:
y_pred

array([103015.20159796, 132582.27760816, 132447.73845174,  71976.09851258,
       178537.48221055, 116161.24230165,  67851.69209676,  98791.73374687,
       113969.43533012, 167921.0656955 ])

In [25]:
x_test.head()

    R&D Spend  Administration  Marketing Spend  Florida  New York
28   66051.52       182645.56        118148.20        1         0
11  100671.96        91790.61        249744.55        0         0
10  101913.08       110594.11        229160.95        1         0
41   27892.92        84710.77        164470.71        1         0
2   153441.51       101145.55        407934.54        1         0

In [26]:
from sklearn.metrics import r2_score

In [27]:
r2 = r2_score(y_test,y_pred)

In [28]:
r2

0.9347068473282423

In [29]:
model.score(x_train,y_train)

0.9501847627493607

In [30]:
model.score(x_test,y_test)

0.9347068473282423

In [31]:
import pickle

In [32]:
pickle.dump(model,(open("model.pkl","wb")))

In [67]:
yy = model.predict([[165349.2,136897.8,471784.1,0,1]])

In [68]:
yy

array([192919.57537462])